- https://www.kaggle.com/kralmachine/data-analysis-visualization-for-beginners

# 데이터 불러오기

In [4]:
import pandas as pd
data = pd.read_csv('Loan_payments_data.csv')

- Loan_id :A unique loan number assigned to each loan customers
- Loan_status: Whether a loan is paid off, in collection, new customer yet to payoff, or paid off after the collection efforts
- Principal: Basic principal loan amount at the origination #대출원금
- terms: Can be weekly (7 days), biweekly, and monthly payoff schedule
- Effective_date : When the loan got originated and took effects # 대출 시작 및 효력날짜?
- Due_date: Since it’s one-time payoff schedule, each loan has one single due date #상환만기날짜
- Paidoff_time: The actual time a customer pays off the loan#갚은날짜
- Pastdue_days: How many days a loan has been past due #오버된 날짜 
- Age,education,gender: customer’s basic demographic information

#Loan Collection : 대출회수

In [5]:
data

,Loan_ID,loan_status,Principal,terms,effective_date,due_date,paid_off_time,past_due_days,age,education,Gender
0,xqd20166231,PAIDOFF,1000,30,9/8/2016,10/7/2016,9/14/2016 19:31,NaN,45,High School or Below,male
1,xqd20168902,PAIDOFF,1000,30,9/8/2016,10/7/2016,10/7/2016 9:00,NaN,50,Bechalor,female
2,xqd20160003,PAIDOFF,1000,30,9/8/2016,10/7/2016,9/25/2016 16:58,NaN,33,Bechalor,female
3,xqd20160004,PAIDOFF,1000,15,9/8/2016,9/22/2016,9/22/2016 20:00,NaN,27,college,male
4,xqd20160005,PAIDOFF,1000,30,9/9/2016,10/8/2016,9/23/2016 21:36,NaN,28,college,female
...,...,...,...,...,...,...,...,...,...,...,...
495,xqd20160496,COLLECTION_PAIDOFF,1000,30,9/12/2016,10/11/2016,10/14/2016 19:08,3.0,28,High School or Below,male
496,xqd20160497,COLLECTION_PAIDOFF,1000,15,9/12/2016,9/26/2016,10/10/2016 20:02,14.0,26,High School or Below,male
497,xqd20160498,COLLECTION_PAIDOFF,800,15,9/12/2016,9/26/2016,9/29/2016 11:49,3.0,30,college,male
498,xqd20160499,COLLECTION_PAIDOFF,1000,30,9/12/2016,11/10/2016,11/11/2016 22:40,1.0,38,college,female
499,xqd20160500,COLLECTION_PAIDOFF,1000,30,9/12/2016,10/11/2016,10/19/2016 11:58,8.0,28,High School or Below,male

In [7]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns
from plotly.offline import init_notebook_mode,iplot
init_notebook_mode(connected=True)
import plotly.graph_objs as go
import warnings
warnings.filterwarnings('ignore')

# EDA

## 데이터확인

In [8]:
data.head()

,Loan_ID,loan_status,Principal,terms,effective_date,due_date,paid_off_time,past_due_days,age,education,Gender
0,xqd20166231,PAIDOFF,1000,30,9/8/2016,10/7/2016,9/14/2016 19:31,NaN,45,High School or Below,male
1,xqd20168902,PAIDOFF,1000,30,9/8/2016,10/7/2016,10/7/2016 9:00,NaN,50,Bechalor,female
2,xqd20160003,PAIDOFF,1000,30,9/8/2016,10/7/2016,9/25/2016 16:58,NaN,33,Bechalor,female
3,xqd20160004,PAIDOFF,1000,15,9/8/2016,9/22/2016,9/22/2016 20:00,NaN,27,college,male
4,xqd20160005,PAIDOFF,1000,30,9/9/2016,10/8/2016,9/23/2016 21:36,NaN,28,college,female

In [9]:
data.tail()

,Loan_ID,loan_status,Principal,terms,effective_date,due_date,paid_off_time,past_due_days,age,education,Gender
495,xqd20160496,COLLECTION_PAIDOFF,1000,30,9/12/2016,10/11/2016,10/14/2016 19:08,3.0,28,High School or Below,male
496,xqd20160497,COLLECTION_PAIDOFF,1000,15,9/12/2016,9/26/2016,10/10/2016 20:02,14.0,26,High School or Below,male
497,xqd20160498,COLLECTION_PAIDOFF,800,15,9/12/2016,9/26/2016,9/29/2016 11:49,3.0,30,college,male
498,xqd20160499,COLLECTION_PAIDOFF,1000,30,9/12/2016,11/10/2016,11/11/2016 22:40,1.0,38,college,female
499,xqd20160500,COLLECTION_PAIDOFF,1000,30,9/12/2016,10/11/2016,10/19/2016 11:58,8.0,28,High School or Below,male

In [20]:
# data info
data.info()

data_info
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Loan_ID         500 non-null    object
 1   loan_status     500 non-null    object
 2   Principal       500 non-null    int64
 3   terms           500 non-null    int64
 4   effective_date  500 non-null    object
 5   due_date        500 non-null    object
 6   paid_off_time   400 non-null    object
 7   past_due_days   200 non-null    float64
 8   age             500 non-null    int64
 9   education       500 non-null    object
 10  Gender          500 non-null    object
dtypes: float64(1), int64(3), object(7)
memory usage: 43.1+ KB

In [11]:
# data describe
data.describe()

         Principal       terms  past_due_days         age
count   500.000000  500.000000      200.00000  500.000000
mean    943.200000   22.824000       36.01000   31.116000
std     115.240274    8.000064       29.38088    6.084784
min     300.000000    7.000000        1.00000   18.000000
25%    1000.000000   15.000000        3.00000   27.000000
50%    1000.000000   30.000000       37.00000   30.000000
75%    1000.000000   30.000000       60.00000   35.000000
max    1000.000000   30.000000       76.00000   51.000000

In [13]:
#data age describe
data.age.describe()

count    500.000000
mean      31.116000
std        6.084784
min       18.000000
25%       27.000000
50%       30.000000
75%       35.000000
max       51.000000
Name: age, dtype: float64

In [23]:
# age and terms describe

print(data[['age','terms']].describe())

              age       terms
count  500.000000  500.000000
mean    31.116000   22.824000
std      6.084784    8.000064
min     18.000000    7.000000
25%     27.000000   15.000000
50%     30.000000   30.000000
75%     35.000000   30.000000
max     51.000000   30.000000

In [25]:
#data shape
data.shape

(500, 11)

## 상관계수

In [26]:
# data corr  # int값만 가능 
data.corr()

               Principal     terms  past_due_days       age
Principal       1.000000  0.534302      -0.093139 -0.092613
terms           0.534302  1.000000      -0.102613 -0.074259
past_due_days  -0.093139 -0.102613       1.000000 -0.053849
age            -0.092613 -0.074259      -0.053849  1.000000

In [27]:
# age terms  corr

data[['age','terms']].corr()

            age     terms
age    1.000000 -0.074259
terms -0.074259  1.000000

In [28]:
# data dtypes

data.dtypes

Loan_ID            object
loan_status        object
Principal           int64
terms               int64
effective_date     object
due_date           object
paid_off_time      object
past_due_days     float64
age                 int64
education          object
Gender             object
dtype: object

In [29]:
# data size
data.size

5500

In [30]:
data.isnull().sum()

Loan_ID             0
loan_status         0
Principal           0
terms               0
effective_date      0
due_date            0
paid_off_time     100
past_due_days     300
age                 0
education           0
Gender              0
dtype: int64

In [31]:
# data columns

for col in data.columns:
    print(col)

Loan_ID
loan_status
Principal
terms
effective_date
due_date
paid_off_time
past_due_days
age
education
Gender

In [34]:
# rename

data = data.rename(columns={'Loan_ID':'load_id',
                           'Principal':'principal',
                           'Gender':'gender'})

for col in data.columns:
    print(col)

load_id
loan_status
principal
terms
effective_date
due_date
paid_off_time
past_due_days
age
education
gender

## column별 상태확인

In [37]:
# loan status

data['loan_status'].value_counts(dropna=False)

#paid off 갚은애들
#collection_paid off 지났지만 갚은애들
#collection 아직 안갚은애들  => PAID_off_TIME 이 NAN 값

PAIDOFF               300
COLLECTION_PAIDOFF    100
COLLECTION            100
Name: loan_status, dtype: int64

In [41]:
data[data['loan_status'] =='COLLECTION_PAIDOFF']

,load_id,loan_status,principal,terms,effective_date,due_date,paid_off_time,past_due_days,age,education,gender
400,xqd20160401,COLLECTION_PAIDOFF,1000,30,9/9/2016,10/8/2016,10/10/2016 11:45,2.0,26,college,male
401,xqd20160402,COLLECTION_PAIDOFF,1000,15,9/9/2016,9/23/2016,9/27/2016 17:00,4.0,28,college,male
402,xqd20320403,COLLECTION_PAIDOFF,1000,30,9/9/2016,11/7/2016,11/20/2016 14:10,13.0,39,college,male
403,xqd20160404,COLLECTION_PAIDOFF,1000,15,9/9/2016,9/23/2016,9/28/2016 15:38,5.0,29,Bechalor,male
404,xqd20190405,COLLECTION_PAIDOFF,800,15,9/9/2016,9/23/2016,9/26/2016 17:22,3.0,33,High School or Below,male
...,...,...,...,...,...,...,...,...,...,...,...
495,xqd20160496,COLLECTION_PAIDOFF,1000,30,9/12/2016,10/11/2016,10/14/2016 19:08,3.0,28,High School or Below,male
496,xqd20160497,COLLECTION_PAIDOFF,1000,15,9/12/2016,9/26/2016,10/10/2016 20:02,14.0,26,High School or Below,male
497,xqd20160498,COLLECTION_PAIDOFF,800,15,9/12/2016,9/26/2016,9/29/2016 11:49,3.0,30,college,male
498,xqd20160499,COLLECTION_PAIDOFF,1000,30,9/12/2016,11/10/2016,11/11/2016 22:40,1.0,38,college,female
499,xqd20160500,COLLECTION_PAIDOFF,1000,30,9/12/2016,10/11/2016,10/19/2016 11:58,8.0,28,High School or Below,male

In [43]:
data[data['loan_status'] =='COLLECTION']

,load_id,loan_status,principal,terms,effective_date,due_date,paid_off_time,past_due_days,age,education,gender
300,xqd20160301,COLLECTION,1000,15,9/9/2016,9/23/2016,NaN,76.0,29,college,male
301,xqd20160302,COLLECTION,1000,30,9/9/2016,10/8/2016,NaN,61.0,37,High School or Below,male
302,xqd20160303,COLLECTION,1000,30,9/9/2016,10/8/2016,NaN,61.0,33,High School or Below,male
303,xqd20160304,COLLECTION,800,15,9/9/2016,9/23/2016,NaN,76.0,27,college,male
304,xqd20160305,COLLECTION,800,15,9/9/2016,9/23/2016,NaN,76.0,24,Bechalor,male
...,...,...,...,...,...,...,...,...,...,...,...
395,xqd20160396,COLLECTION,1000,30,9/11/2016,10/10/2016,NaN,59.0,25,High School or Below,male
396,xqd20160397,COLLECTION,1000,30,9/12/2016,10/11/2016,NaN,58.0,33,High School or Below,male
397,xqd20160398,COLLECTION,800,15,9/12/2016,9/26/2016,NaN,73.0,39,college,male
398,xqd20160399,COLLECTION,1000,30,9/12/2016,11/10/2016,NaN,28.0,28,college,male
399,xqd20160400,COLLECTION,1000,30,9/12/2016,10/11/2016,NaN,58.0,26,college,male